// напишите программу, которая на вход принимает число
// и выдает его квадрат (число умноженное на само себя)

Console.WriteLine("Введите число");
int number = Convert.ToInt32 (Console.ReadLine());

int sqt = number*number;

Console.WriteLine(sqt);
